[
  {
    "path": "posts/2021-03-13-dataviz-makeover3/",
    "title": "DataViz Makeover 3",
    "description": "My DataViz Makeover 3 for ISSS608",
    "author": [
      {
        "name": "Siow Mun Chai",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-03-13",
    "categories": [],
    "contents": "\r\nData Visualisation Critique\r\nThe original visualisation (as follows) reveal the spatio-temporal patterns of armed conflict in selected South-East Asia countries between 2015 to 2020. \r\nClarity\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nUnder the “Armed Conflict Event by Type” chart, the Y-axis for each of the event type did not start from 0 and had different interval values. This will mislead the reader in thinking that the line chart are of the same value scale.\r\nTo standardise the Y-axis interval.\r\n2.\r\nUnder the “Armed Conflict Event by Type” chart, the title of the Y-axis (“Count of Sheet1”) is not intuitive. Unsure what the Y-value actually meant.\r\nTo change the title of the Y-axis.\r\n3.\r\nThe title for the left chart stated that the map shows information on Myanmar. However, the title for the right chart did not confirm that the information showed in the right charts are for Myanmar.\r\nTo label the title clearly.\r\n4.\r\nBesides showing the location of the events that occurs, the colored circles on the map serve no other purposes. Moreover, multiple events could happened on the same location and could not be picked up by the readers. Will be good to show summation of number of events that occur on a particular location.\r\nTo provide summation information.\r\nAesthetics\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nThe colored circles on the map had covered the labeling for “Myanmar”. Will be good to label the country so that readers know that is the map for Myanmar.\r\nTo label the countries clearly.\r\n2.\r\nUnder the “Armed Conflict Event by Type” chart, the value after 2019 could not be seen clearly.\r\nTo show the value of the X-axis clearly.\r\n3.\r\nThe labeling on the right chart should use darker color tone to make it more prominent.\r\nTo use darker color tone for label.\r\n4.\r\nNo X-axis gridline for the right chart. Hard to interpret the value for the x-axis (Year).\r\nTo include gridline for X-axis.\r\nInteractivity\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nCurrently, readers are only able to filter by country. Should also allow readers to filter by event types so that he can focus on the information that he wanted.\r\nTo allow readers to select and focus on the event of his choice as well.\r\n2.\r\nThe tooltip show the Event ID Cnty, Longitude, Latitude and Event Type. The information presented is not useful to readers.Could provide more statistical information to the readers.\r\nTo provide more statistical information in the tooltips.\r\nProposed Design\r\nDesign SketchThe Advantages or issues that the alternative design tries to overcome are:\r\nTooltip to include more statistical information of the country.\r\nTo provide overview of the type of events (Demonstrations (includes Protests and Riots), Non-violent Actions (includes Strategic Developments) and Violent Events (includes Battles, Explosions/Remote Violence and Violence against Civilians)) instead of the detailed breakdown of the different type of events (Battles, Explosions/Remote Violence, Protests, Riots, Strategic Developments and Violence against civilian). This will allow readers to have a quick overview of the information. The detailed breakdown will be included in the tooltips. Those interested can see more details under the tooltips. \r\nUse Choropleth Map to represent the number of events that each countries have. This will give readers a quick overview on the number of events that happened in South East Asia. Readers who want to know more details can read more information in the tooltip.\r\nBeside country, to also allow readers to filter information by event type. This allow user to focus on the type of event he wanted. \r\nBeside the number of events, to include information on the number of fatalities as well. \r\nData Visualisation Steps\r\nImport data into Tableau / Data Cleaning \r\nSelect “Microsoft Excel” from Connect Panel.\r\nSelect “Southeast-Asia_2010-2020_Oct31.xlxs”. \r\nClick on Add filter to choose data from 2015 to 2020 only. \r\nAdd filter to “Event Date”. \r\nSelect only 2015 to 2020 under Years \r\nHide all the parameters except “Event Id Cnty”, “Event Date”, “Event Type”, “Country”, “Latitude”, “longtitude”,“Year”, “Location” and “Fatalities”.\r\nCreate a new calculated field “Event_Overview” to aggregate the event_type into three groups. \r\nOn the connection, click on Extract. \r\nCreate Visualisation for EventType \r\nPut \"Event Date to Column, Event Type to Rows, Event Id Cnty to Rows. \r\nChange the Measure for Event Id Cnty to Count. \r\nChange the CNT(Event Id Cnty) to Bar under Marks card. \r\nPut Fatalities to Rows. \r\nChange the Fatalities to Line under Marks card. \r\nConvert SUM(Fatalities) into Dual Axis. \r\nSynchronise the axes. \r\nUnhide the Show Header \r\nEdit the axis to change the title of the Y-axis to Total. \r\nBring the Mark to front. \r\nChange the Color of the Bar and Line by clicking on Color and edit color. \r\nPut Year to Detail under CNT(Event Id Cnty) Marks card and Rename the Title of the Chart. \r\nCreate a Parameter “Select a View”. Right click on any empty pane, select Create Parameter.\r\nCreate a Calculated Field “Display Sheet”. \r\nAdd Display Sheet to Filter. \r\nSelect Custom Value List and put in Overview. \r\nSave the sheet as EventType.\r\nCreate Visualisation for EventOverview \r\nDuplicate the EventType sheet. \r\nRename the sheet as EventOverview. \r\nReplace EventType in Rows with Event_Overview. \r\nRename the Measure Name. \r\nChange the Alias. \r\nPut Country to Filter. \r\nClick on Show Filter. \r\nChoose Selected Worksheets. \r\nAllow the filter to be applied to all sheets. Click on Apply to Worksheets. \r\nPut Event Date to Filter and choose Range of Date (1 Jan 2015 to 31 Dec 2020). \r\nAdd in a reference line by right clicking on the pane. \r\nApply the filter to all the sheets.\r\nCreate Visualisation for ToolTip1 \r\nPut Country to Columns, Event_Overview to Rows and Event Id Cnty to Text (changing measures to Cnt).\r\nSave the sheet as ToolTip1. \r\nCreate Visualisation for ToolTip2 \r\nDuplicate ToolTip1. \r\nReplace Event_Overview with Event Type. \r\nSave the sheet as ToolTip2. \r\nCreate Visualisation for Percentage Chart \r\nPut Country to Columns, Event Id Cnty to Rows (changing measures to Cnt) and Event Overview to Color.\r\nGo to Quick Table Calculation under CNT(Event Id Cnty) and change to Percent of Total. \r\nChange the Compute Using to Table(Down). \r\nSave the sheet as Percentage Chart. \r\nCreate Visualisation for Percentage Chart2 \r\nDuplicate Percentage Chart. \r\nReplace Event_Overview with Event Type. \r\nSave the sheet as Percentage Chart2. \r\nCreate Visualisation for ByCountry \r\nPut Country and Event Date to Columns, Event Id Cnty (Change measure to Cnt) to Rows and Event Type to Color. \r\nChange to Line, under Marks Card. \r\nChange the Axis title to Total by double clicking on it. \r\nPut Display Sheet to Filter. Select Custom Value List and put in By Country \r\nSave the sheet as ByCountry. \r\nCreate Visualisation for ByEvent \r\nDuplicate ByCountry. \r\nReplace Country with Event Type. \r\nPut Display Sheet to Filter. Select Custom Value List and put in By Event \r\nSave the sheet as ByEvent. \r\nCreate Visualisation for DetailedMap \r\nPut Longitude to Columns and Latitude to Rows. \r\nPut EventType to Color, location to Detail and Event Id Cnty to Size \r\nChange the Event Id Cnty Measures to Count. \r\nChange the Color Opacity to 75%. \r\nRight click on Country to create a new layer. \r\nPut Country to Color and Year to Detail, under the Country Marks Card. Change to Map \r\nChange the Opacity to 5% and Color of the Countries. \r\nEdit the Tooltips. \r\nChange the title of the sheet. \r\nAllow user to filter by Event Type. Drag Event Type to Filter. \r\nShow Filter and change it to Single Value (list). Change the title. \r\nAllow the filter to be applied to all sheets. Click on Apply to Worksheets. \r\nChoose Selected Worksheets. \r\nChange the tooltips. \r\nSave the sheet as DetailedMap\r\nCreate Visualisation for MapOverview \r\nPut Longitude(generated) to Columns and Latitude(generated) to Rows. \r\nPut Event Id Cnty to Color and choose Add all members \r\nChange Measure to Count \r\nPut Country to Label, Country to Detail, Fatalities to Detail\r\nHold on the Cntrl key and drag Latitude(generated). \r\nOn the second Latitude(generated) Mark card, put Event_Overview to Color and Country to Detail. \r\nPut Event Id Cnty to Size and change the Measure to Count.\r\nChange the Size. \r\nOn the Latitude(generated), click on Dual Axis. \r\nChange the title of the sheet. \r\nChange the title for CNT(Event Id Cnty). \r\nChange the color of the Number of Conflicts. \r\nRename the title for Event_Overview.\r\nChange the tooltips. \r\nSave the sheet as MapOverview. \r\nCreate Dashboard - MainDash \r\nDrag MapOverview and EventOverview to the Dashboard. \r\nResize and rearrange the “Menu Bar”. Add in a Navigation Button by selecting it under Object. \r\nRename the dashboard as MainDash.\r\nCreate Dashboard - DetailedDash \r\nDrag DetailedMap and EventType to the Dashboard. \r\nChange the Object to Floating. \r\nDrag a Vertical object to the dashboard and align it to EventType Pane. \r\nHold down shift key and drag ByCountry to the “Floating Pane”. \r\nRepeat steps 3 and 4 for ByEvent.\r\nAdd a Text object to the center of the dashboard. \r\nResize and rearrange the “Legend Bar”. Add in a Navigation Buttons \r\nRename the dashboard as DetailedDash.\r\nFinal Data Visualisation Output\r\n\r\nChanges from Original Design\r\nTo have a total of two dashboards instead of one. The first dashboard give readers a quick overview of\r\nthe number of fatalities from 2015 to 2020.\r\nPie chart on the map to detailed out the proportion of events/conflicts (Demonstrations, Non-violent Actions and Violent Events).\r\nAn overview of the number of events/conflicts that each countries have using Choropleth Map.\r\nTooltips to show breakdown of the total of event and percentage of total.\r\nReaders who are interested in more details, able to navigate to the next dashboard for more information.\r\nThe second dashboard provide readers with:\r\nDetailed location of each of the event/conflict.\r\nChart to show the number of fatalities and conflicts, breakdown by event type (Battles, Explosions/Remote Violence, Protests, Riots, Strategic Developments and Violence against civilian).\r\nAllow readers to filter by country or by event, so as to focus on the relevant information.\r\nTooltips to show breakdown of the total of event and percentage of total.\r\nAllow readers to change the view of the chart (by Country or by Event)\r\nObservation 1\r\nBased on the Choropleth Map, it shows that Philippines had the most number of conflicts between 2015 to 2020. Focusing on Philippines, it can be observed that the number of fatalities due to violent conflicts gradually decreases from 2016. \r\nObservation 2\r\nBased on the pie chart on the map, it can be observed that the capital of the countries experienced the most number of protests. \r\nObservation 3\r\nMost of the Battles in Myanmar, occurred in Rakhine and Shan state. In Thailand, most of the battles happened at the southern states (Narathiwat, Yala and Pattani). In Philippines, battles happened across the country. \r\nObservation 4\r\nBattles and Violence against Civilians resulted in most number of fatalities. \r\nObservation 5\r\nKalimantan (Indonesia) is relatively peaceful, without much conflicts from 2015 to 2020. Most of the conflicts happened at the borders of Kalimantan. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-20T11:55:49+08:00",
    "input_file": "dataviz-makeover3.utf8.md"
  },
  {
    "path": "posts/2021-02-11-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "My DataViz Makeover 2 for ISSS608",
    "author": [
      {
        "name": "Siow Mun Chai",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-11",
    "categories": [],
    "contents": "\r\nData Visualisation Critique\r\nThe original visualisation (as follows) shows the willingness of the public on Covid-19 vaccination. \r\nClarity\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nUnable to determine the total number of people that responded to the survey. The result might not be representative if only a small number of people were interviewed.\r\nTo include the number of people interviewed from each country.\r\n2.\r\nThe chart was derived from the survey question “If a Covid-19 vaccine were made available to me this week, I would definitely get it:”. This question does not imply that the individuals are pro-vaccine. There are other similar questions (e.g: “If I do not get a COVID19 vaccine when it is available, I will regret it”) but the results were not used. The result might not be representative and will be misleading to the reader.\r\nTo change the title of the graph or include the question to provide clarity.\r\n3.\r\nThe “Legend” was titled as “Vac1”. Unclear what “Vac1” means. Number 2 to 4 are not labelled to tell reader what it represent.\r\nTo be clear on the information presented.\r\n4.\r\nIs hard to determine the value for each of the response (color bar).\r\nTo label the value for each color bar or re-position the bar.\r\nAesthetics\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nAll axes are clearly labeled.\r\nTo continue to label all axes.\r\n2.\r\nGood font and good font size to detailed out the information.\r\nTo maintain the use of good font and good font size.\r\n3.\r\nThe choice of color for the bar is distracting and overwhelming.\r\nTo change the color scheme.\r\n4.\r\nThe left chart was sorted based on country while the right chart was sorted based on percentage of “strongly agreed”. Is hard for reader to match the result for the two charts. Moreover, the information presented in the right chart could be found in the left as well. Is redundant to show the information again (Waste of space).\r\nDo not repeat information presented.\r\n5.\r\nThe gridline for the left chart is too soft / light. Making it hard for reader to use it to reference the values.\r\nTo darken the gridline.\r\n6.\r\nThe X-axis for the right chart stopped at 60%. However, the value for United Kingdom goes beyond 60%. There is a need to extend the tick marks for the X-axis\r\nTo extend the tick marks for x-axis.\r\nProposed Design\r\nDesign SketchThe Advantages or issues that the alternative design tries to overcome are:\r\nChange the scale of the result from 5 (Strongly Agree, Agree, Neutral, Disagree and Strongly Disagree) to 3 (Agree/Strongly Agree, Neutral and Disagree/Strongly Disagree). Presenting the results in a simplified categories helps in making the chart easier to read. Since Strongly Agree and Agree as well as Strongly Disagree and Disagree, in this instance, do indicate inclination towards willingness or unwillingness.\r\nBreak the Disagree, Agree and Neutral into 3 charts so that readers can see the distribution clearly. \r\nShow the questions so that readers better understand the context to the response. Include details such as when the surveys were taken, number of people involved so as to provide more clarity to readers.\r\nAllow breakdown by Gender, Age etc so that readers can better appreciate the details. \r\nTo have tooltip to detail out more information for readers who are interested to find out more. \r\nTo include Confidence Interval to indicate the uncertainty of the outcome.\r\nData Visualisation Steps\r\n Preparing the Dataset 1. Comparing the fields of the dataset, one can realises that Finland, Norway, Denmark and Sweden do not have the field “employment_status”. Instead, the employment status was capture by various fields (employment_status_1, employment_status_2 etc.) 2. To align to the rest of the dataset, need to create the field “employment_status” and change the header to reflect the employment status (“Fulltime Employment”,“Not Working” etc) 3. Use the formula to update the value for “employment_status”. 4. Save the file and repeat it for the rest of the countries (Norway, Denmark and Sweden). 5. For Sweden, there is a need to rename “record” to “RecordNo”, to align to rest of the dataset. \r\nImport data into Tableau  1. Select “Text File” from Connect Panel. 2. Select australia.csv.  3. Remove australia.csv from the panel.  4. Click on “New Union” under the File Panel.  5. Import all the countries into the “New Union” panel and click OK. \r\nCommence Data Preparation 1. Hide all the parameters and retain only the following a) RecordNo b) endtime c) household_children d) household_size e) gender f) age g) employment_status h) vac-1 i) vac2_1 j) vac2_2 k) vac2_3 l) vac2_6 and m) vac3. n) Table Name  2. Convert the Connection to “Extract”  3. As we are only interested in Jan 2021 data, click on “Edit” under FILTER to add a filter.  4. Add a filter for “endtime” and set it to Jan 2021.  5. Edit the range of date to Jan 2021, to use only Jan 2021 data. 6. Select (vac1, vac2_1, vac2_2, vac2_3, vac2_6 and vac3) and pivot the data, for ease of processing subsequently.  7. Rename the “Pivot Field Names” to “Question” and “Pivot Field Values” to “Answer”  8. Change the aliases for Question to reflect the actual questions.  9. As the “Answer” value consist of a mix of character and numeric data, need to remove all the characters information. Click on “Custom Split” at “Answer”  10. Add in the separator “–” to “Answer” 11. Add in separator “-” to Answer-Split1  12. Rename Answer-Split2 to “Answer_Cleaned” and change data type to “Number(Whole)”  13. Change the data type for household_size to String.  14. Change the aliases of “Table Name” to remove the .csv portion. \r\nSave the data  1. Click on “Sheet 1” and save the data as “dataviz2.hyer” \r\nPrepare Fields for Visualisation  1. To count the number of record for subsequent formula, Create Calculated Field “RecordNumber” 2. To set record with Negative value to 1 by creating a Calculated Field “Negative Score”. 3. To set record with Positive value to 1 by creating a Calculated Field “Positive Score”. 4. To set record with Neutral value to 1 by creating a Create Calculated Field “Neutral Score”. 5. Count the number of Negative score by creating the Calculated Field “Total Negative Score”. 6.Count the number of Positive score by creating the Calculated Field “Total Positive Score”. 7. Count the number of Neutral score by creating the Calculated Field “Total Neutral Score”. 8. Count the total number of records by create the Calculated Field “Total Score”. 8. Count the size/percentage of the negative score by creating Calculated Field “Percentage of Negative Sizing”. 9. Count the size/percentage of the Positive score by creating Calculated Field“Percentage of Positive Sizing”. 10. Count the size/percentage of the Neutral score by creating Calculated Field Create Calculated Field “Percentage of Neutral Sizing”. 11. Change the “Number Format” to Percentage for “Percentage of Neutral Sizing”, “Percentage of Positive Sizing” and \" Percentage of Negative Sizing“. 12. Create Calculated Field”Gantt Positive Percent“. 13. Create Calculated Field”Gantt Neutral Percent“. 14. Create Calculated Field”Gantt Negative Start“. 15. Create Calculated Field”Gantt Negative Percent“. 16. Convert the response from 5 scale to 3 scale value (Agree/Strongly Agree, Disagree/Strongly Disagree) by duplicating”Answer_Cleaned\" and edit the formula. Save the edited formula as Answer_Grp.  17. Create Calculated Field “Negative Score_Gantt”  18. Create Calculated Field “Total_Negative_Score_Gantt”  19. Create Calculated Field “Gantt Start”  20. Create Calculated Field “Gantt Percent”  21. Age is currently a range of value. Need to bin the value into 3 different bin. Go to Age and create Group. 22. Create the following Age Group.  23. To provide reader with the option of breaking down the data into different categories, Create Parameter “Breakdown”.  24. Create Calculated Field “Breakdown By”.  25. Rename “Table Name” to “Countries” \r\nCreate a sheet to be included as part of Tooltip. This sheet will be used to detailed out the percentage for each of the rating. \r\nCreate a new sheet “DetailedStat”. Drag “Answer_Grp” to Rows, “Measure Names” to Columns, “Gantt Percent” and “Percentage of Total Sizing” to Measure Values. \r\nDrag the “Breakdown By” to the Columns to facilitate the use of Breakdown parameter.\r\nCreate a sheet to be included as part of Tooltip. This sheet will be used as Legend for the Likert Scale. \r\nDrag “Answer_Cleaned” to Columns. “Answer_Cleaned” to Color and “CNTD(RecordNumber)” to Size. \r\nSave the sheet as Legend. \r\nCreate a sheet to show the result of the survey in Likert Scale. This sheet will be used as part of the Tooltip. \r\nGo to a new sheet. Drag “Gantt Percent” to Columns. “Countries” to Rows. “Answer_Cleaned” to Color and “Percentage of Total Sizing” to Size and Label. Change the “Compute Using” for “Gantt Percent” and “Percentage of Total Sizing” to “Answer_Cleaned”. \r\nRight click on the x-axis and select “Add Reference Line” to add Reference Line. \r\nAt the popup, change the “Value” to 0 and Constant. Label to None, Tooltip to None and Line to —–  4. Save the sheet as “Gantt_Tooltip”.\r\nCreate a sheet that will calculate the 95% Confidence Interval of the survey result. This sheet would be added into the tooltip. \r\nCreate a new calculated field “Prop Positive”. This is to count the probability of all Agree/Strongly Agree score.\r\nCreate a new calculated field “Prop Negative”. This is to count the probability of all DisAgree/Strongly DisAgree score.\r\nCreate a new calculated field “Prop Neutral”. This is to count the probability of Neutral score.\r\nCreate a new calculated field “Prop_SE_Positive” \r\nCreate a new calculated field “Prop_ SE_Negative” \r\nCreate a new calculated field “Prop_SE_Neutral” \r\nCreate a new calculated field \"Prop_Upper_Limit_95%_Positive\", to calculate the upper limit of the Agree/Strongly Agree 95% Confidence Interval. \r\nCreate a new calculated field \"Prop_Upper_Limit_95%_Negative\", to calculate the upper limit of the DisAgree/Strongly DisAgree 95% Confidence Interval. \r\nCreate a new calculated field \"Prop_Upper_Limit_95%_Neutral\", to calculate the upper limit of the Neutral 95% Confidence Interval \r\nCreate a new calculated field \"Prop_Lower_Limit_95%_Neutral\" \r\nCreate a new calculated field \"Prop_Lower_Limit_95%_Positive\" \r\nCreate a new calculated field \"Prop_Lower_Limit_95%_Negative\" \r\nCreate a new calculated field “Z_95%” to store the value of the Z-score \r\nDrag “Prop_Positive” to Columns and Countries to “Rows”. Change it to Circle under the Mark card.  15. Drag Measure Values to centre of the screen \r\nExclude all the values and only retain \"Prop_Lower_Limit_95%_Positive\" and \"Prop_Upper_Limit_95%_Positive\"\r\nOn the x-axis, click “Synchronize Axis” \r\nUnder the “Measure Values” Mark card, Change it to Line \r\nDrag the “Measure Name” to Path. \r\nChange the “Compute Using” for \"Prop_Lower_Limit_95%_Positive“,”Prop_Upper_Limit_95%_Positive\" and “Prop Positive” to Cells. \r\nRight click on the Value axis and uncheck the Show Header. \r\nRight click on Prop Positive axis and choose format. Change the scale to Percentage. \r\nGo to Measure Values Mark card, change the color. \r\nGo to Prop Positive Mark card and change the size. \r\nSwitch the Prop_Positive and Measure Values under Column. \r\nSave the sheet as “Conf_Positive”. \r\nRepeat the process in creating Conf_Positive for “Conf_Negative” and “Conf_Neutral”. This time choosing Prop_Lower_Limit_95%_Negative and Prop_Upper_Limit_95%_Negative for “Conf_Negative” and Prop_Lower_Limit_95%_Neutral and Prop_Upper_Limit_95%_Neutral for “Conf_Neutral”\r\nCreate Visualisation in sheets 1. Create a new sheets and name it “Main”. Drag “Gantt Negative Percent” to Columns, “Table Name” to Rows, “Answer_Grp to Color and”Percentage of Negative Sizing\" to Size.  2. Change the Compute Using for “Gantt Negative Percent” and “Percentage of Negative Sizing” to “Answer_Grp”. 3. Drag “Gantt Positive Percent” to Columns,“Answer_Grp” to Color and “Percentage of Positive Sizing” to Size.  4. Change the Compute Using for “Gantt Positive Percent” and “Percentage of Positive Sizing” to “Answer_Grp”. 5. Drag “Gantt Neutral Percent” to Columns,“Answer_Grp” to Color and “Percentage of Neutral Sizing” to Size.  6. Change the Compute Using for “Gantt Neutral Percent” and “Percentage of Neutral Sizing” to “Answer_Grp”.\r\nChange the title of the x-axis. \r\nChange the scale of x-axis to Percentage and change the range. \r\nAdd “Breakdown By” to Rows of “Main”. Under Parameter, Click on “Show Parameter” for “Breakdown”. \r\nAdd “Question” to Filter and click OK. \r\nAllow the “Question” filter to apply to other sheets (“Grantt_Tooltip”,“DetailedStat”,“Prop_Positive”, “Prop_Negative” and “Prop_Neutral”) by right clicking on the Question Filter. \r\nGo to Customise and uncheck “Show All Value”. This will remove the (All) value \r\nOn the “Gantt Negative Percent” card, click on tooltip and edit the tooltip. \r\nSheets can be added to the tooltip by clicking on the “Insert” \r\nChange to tooltip with the code as displayed. \r\nRepeat the process for “Gantt Positive Percent” card. Only different is to insert “Conf_Positive” sheet to the 95% Confidence Interval portion. \r\nRepeat the process for “Gantt Neutral Percent” card. Only different is to insert “Conf_Neutral” sheet to the 95% Confidence Interval portion. \r\nChange the title for Main by right clicking on the title and choose Edit Title. \r\nChange the title as follows: \r\nCreate Dashboard 1. Drag “Main” into Dashboard and name it “FinalDisplay”. \r\nFinal Data Visualisation Output\r\n\r\nObservation 1\r\nBased on the data visualisation for the question: “If a Covid-19 vaccine were made available to me this week, i would definitely get it.”, Singapore have the lowest Percentage of Agree/Strongly Agree (34.5%). However, if only look at Strongly Agree, Japan has the lowest percentage (18.1%). There is a need to determine how to interpret the data for agree and strongly agree (similarly, for disagree and strongly disagree) as it will affect the overall interpretation of the data. \r\nObservation 2\r\nFor all the vaccine-related questions (except “I am worried about getting Covid19” and “I am worried about the potential side effects of a Covid19 vaccine”), the elderly (> 55 years old) are more receptive. Across the 14 countries listed, except South-Korea, participants above 55 years old have the highest percentage of Agree/Strongly Agree, Lowest Percentage of Disagree/Strongly Disagree and Lowest Percentage of Neutral. Figure shows result for one of the questions.\r\n\r\nObservation 3\r\nFor all the vaccine-related questions (except “I am worried about getting Covid19” and “I am worried about the potential side effects of a Covid19 vaccine”), participants from United-Kingdom and Denmark constantly had the highest percentage of Agree/Strongly Agree and lowest percentage of Disagree/Strongly Disagree across the different questions related to Covid-19 vaccine. The two countries also had the narrowest interval between the upper and lower limit, indicating that the result are precised and less uncertainty. Figure shows result for one of the questions.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T13:53:45+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-23-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "My DataViz Makeover 1 for ISSS608",
    "author": [
      {
        "name": "Siow Mun Chai",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\r\nData Visualisation Critique\r\nThe original visualisation (as follows) is the Resident labour force by age (Chart 6) in MOM’s Report. \r\nClarity\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nThere is no Y axis in the visualisation. Therefore, the value of the line graph is not immediately obvious.\r\nTo include Y axis and gridline to guide the eyes.\r\n2.\r\nIt is not intuitive to know which value on the X-axis represent the age and which is the labour force participating rate.\r\nTo include clear labels for the axis.\r\n3.\r\nThe visualisation shows the median age for 2009 is 41 years and the median age for 2019 is 44 years. However, the line graph do not have any statistical information to derive the median age but reference lines were drawn to intercept with the line graph. Inferring that the line graph could generate the median age.\r\nTo remove median data from the visualisation.\r\n4.\r\nThe objective of the visualisation is to show there are more older residents in the labour force since 2009. The visualisation only show data for 2009 and 2019 and not the data between 2009 to 2019. The increasing trend is not apparent to the readers.\r\nTo include data points for the years between 2009 and 2019.\r\n5.\r\nClear graph title to tell readers the context.\r\nTo retain the use of title.\r\n6.\r\nX-axis title could be better positioned and named to provide context.\r\nTo re-position the X-axis title.\r\n7.\r\nSource where the information were from were highlighted to give assurance to reader on the accuracy of the data.\r\nTo retain the source information on the visualisation.\r\nAesthetics\r\nS/N\r\nCRITIQUES\r\nSUGGESTIONS\r\n1.\r\nGood use of colour to differentiate 2009 and 2019 values.\r\nTo maintain the use of colour to differentiate values.\r\n2.\r\nGood font and good font size to detailed out the information.\r\nTo maintain the use of good font and good font size.\r\n3.\r\nUnits are not indicated at the X-axis tick values. Might be hard for readers to interpret what the values represent.\r\nTo provide unit details at the axis.\r\n4.\r\nThe visualisation is not well-balanced as there are too much data value at the X-axis.\r\nTo balance out the data values across the visualisation.\r\nProposed Design\r\n - Provide the data value from 2009 to 2019 so that readers could see the trend. - Grouped the data value (line graph) into 15-24, 25-54 and 54 & above so that readers can clearly see the different categorisation as highlighted in the writeup. - Show the absolute values and the labour participation rate for each of the year, so that readers are able to better appreciate the context.  - Include the labour participation rate and labour participation (in thousands) as the Y-axis so that readers could know reference the value of the line graph.  - Provide labels to describe the axes. - Removed median data from the visualisation as the data values in the visualisation is not able to calculate the median.\r\nData Visualisation Steps\r\nS/N\r\nSTEPS\r\nACTIONS\r\n1.\r\nImport excel file (mrsd_2019LabourForce_T7.xlsx) into Tableau Prep Builder.\r\n1. Select T7_T from the Connection Pane and Single Table in the Input Pane. 2. Add a “Clean Step”\r\n2.\r\nCommence Data Preparation\r\n1. Remove first 6 rows of the data which are all title information. 2. Remove columns with NULL values.  3. Rename first column to Age and the rest of columns to the year starting from 2009 to 2019. 4. Select column 2009 to 2019, pivot the columns to rows. 5. Rename Pivot 1 Name to Year and Pivot 1 Value to Population.\r\n3.\r\nSave the data\r\nSave the output as Output.hyper.\r\n4.\r\nImport the Output.hyper to Tableau\r\n1. Import data into Tableau.  2. Change the data type for Year from String to Date. 3. Change the data type for Population from String to Number(Decimal).\r\n5.\r\nCreate Visualisation for Participation Rate\r\n1. Go to Sheet 1. 2. Drag Year to Columns. 3. Drag Population to Rows. 4. Change the measures for Population to SUM. 5. Change the Percentage of to Cell.\r\n6.\r\nGrouping of Age Group\r\n1. Select 15-19 and 20-24, right click and Grouped them. 2. Select 25-29, 30-34, 35,39,40-44, 45-49 and 50-54 and Grouped them. 3. Select 55-59,60-64, 65-69 and 70 & Over and Grouped them. 4. Rename each of the Age Category and Title. 5. Show the Hide Marker. 6. Rename the Title and axis labels and provide Source information under Caption. 7. Rename the sheet to \"Labour(%)\r\n\r\n\r\n\r\n7.\r\nCreate Visualisation for Population (In Thousands)\r\n1. Duplicate Sheet 1.  2. Click on the row SUM(Population), click “Clear Table Calculation”. 3. Rename the Y-axis title. 4. Rename the sheet to \"Labour(In Thousands)\r\n8.\r\nCreate Dashboard\r\n1. Add a new dashboard  2. Drag Labour(%) to the left of the dashboard and Labour(In Thousands) to the right. 3. Rename the Dashboard Title. 4. Export the dashboard as image.\r\n\r\n\r\n\r\nFinal Data Visualisation Output\r\n\r\nObservation 1\r\nAlthough the labour force participation rate shows the share of resident labour force aged 25-54 declined from 75% to 67%, the absolute number of people in the age band actually increases (from 1496 thousands in 2009 to 1570 thousands in 2019)\r\nObservation 2\r\nOver the last 10 years, both the 25-54 and 15-24 age bands showed a downward trend for the participation rate while the 55 years and above showed a upward trend. Might be due to ageing population and low birth rate.\r\nObservation 3\r\nTotal number of people in the working population increases over the years (from 1986 thousands in 2009 to 2328 thousands in 2019).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-27T22:27:38+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-06-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Siow Mun Chai",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-06",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-06-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-23T14:11:11+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Siow Mun Chai",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-06",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-06T21:39:44+08:00",
    "input_file": {}
  }
]
